app/controllers/accounts_controller.rb

  def api_create
    msisdn = params[:msisdn]
    remote_ip_address = request.remote_ip
    status = "error"

    if !msisdn.blank? && is_a_number?(msisdn) && right_msisdn_length?(msisdn)
      request = Typhoeus::Request.new("http://195.14.0.128:8080/PAYMONEY_WALLET/rest/ussd_create_compte/#{msisdn}", followlocation: true, method: :get)

      request.on_complete do |response|
        if response.success?
          response = (JSON.parse(request.response.body) rescue nil)
          unless response.blank?
            if response["status"].to_s == "1" && response["nom"].to_s == msisdn && response["compte"] != blank?
              status = "1"
              Account.create(msisdn: msisdn, account_number: response["compte"], remote_ip_address: remote_ip_address)
              Log.create(transaction_type: "Creation", phone_number: msisdn, response_log: response.to_s, status: true, remote_ip_address: remote_ip_address)
---
INSERT INTO "accounts" ("account_number", "created_at", "msisdn", "remote_ip_address", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["account_number", "73960000000074"], ["created_at", "2015-07-01 18:39:04.482701"], ["msisdn", "48485390"], ["remote_ip_address", "127.0.0.1"], ["updated_at", "2015-07-01 18:39:04.482701"]]
INSERT INTO "logs" ("created_at", "phone_number", "remote_ip_address", "response_log", "status", "transaction_type", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def api_credit_account
    account = params[:account]
    transaction_amount = params[:transaction_amount]
    agent = params[:agent]
    sub_agent = params[:sub_agent]
    remote_ip_address = request.remote_ip
    response_log = "none"
    error_log = "none"
    status = "|5000|"
    transaction_status = false

    account_token = check_account_number(account)

    if account_token.blank?
      status = "|4041|"
    else
      merchant_pos = CertifiedAgent.where("certified_agent_id = '#{params[:agent]}' AND sub_certified_agent_id IS NULL").first rescue nil
      if merchant_pos.blank?
        status = "|4042|"
      else
        if !account.blank? && is_a_number?(transaction_amount)
          transaction_id = Digest::SHA1.hexdigest([DateTime.now.iso8601(6), rand].join)
          BombLog.create(sent_url: "#{Parameter.first.paymoney_wallet_url}/PAYMONEY_WALLET/rest/cash_in_operation_pos/TYHHKIRE/#{account_token}/#{merchant_pos.token}/#{(transaction_amount.to_i rescue 0) - 100}/0/100/#{transaction_id}/null")
---
SELECT  "certified_agents".* FROM "certified_agents"  WHERE (certified_agent_id = '1ffee1b27a94d34d' AND sub_certified_agent_id IS NULL)  ORDER BY "certified_agents"."id" ASC LIMIT 1
INSERT INTO "bomb_logs" ("created_at", "sent_url", "updated_at") VALUES ($1, $2, $3) RETURNING "id"
INSERT INTO "logs" ("account_number", "agent", "created_at", "credit_amount", "otp", "pin", "remote_ip_address", "response_log", "status", "sub_agent", "thumb", "transaction_id", "transaction_type", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
SELECT  "parameters".* FROM "parameters"   ORDER BY "parameters"."id" ASC LIMIT 1

  def api_sold
    account = params[:account]
    password = params[:password]
    agent = params[:agent]
    sub_agent = params[:sub_agent]
    remote_ip_address = request.remote_ip
    status = "|5000|"
    response_log = "none"
    error_log = "none"
    transaction_status = false

    merchant_pos = CertifiedAgent.where("certified_agent_id = '#{params[:agent]}' AND sub_certified_agent_id IS NULL").first rescue nil
    if merchant_pos.blank?
      status = "|4042|"
    else
      if !account.blank? && !password.blank?
        transaction_id = Digest::SHA1.hexdigest([DateTime.now.iso8601(6), rand].join)
        BombLog.create(sent_url: "#{Parameter.first.paymoney_wallet_url}/PAYMONEY_WALLET/rest/solte_compte/#{account}/#{password}")
---
SELECT  "certified_agents".* FROM "certified_agents"  WHERE (certified_agent_id = '8fa944c4484227a0' AND sub_certified_agent_id IS NULL)  ORDER BY "certified_agents"."id" ASC LIMIT 1
INSERT INTO "bomb_logs" ("created_at", "sent_url", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2015-10-06 11:33:40.749702"], ["sent_url", "94.247.178.141:8080/PAYMONEY_WALLET/rest/solte_compte/21080000000003/8064"], ["updated_at", "2015-10-06 11:33:40.749702"]]
INSERT INTO "logs" ("account_number", "agent", "created_at", "remote_ip_address", "response_log", "status", "sub_agent", "transaction_id", "transaction_type", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
SELECT  "parameters".* FROM "parameters"   ORDER BY "parameters"."id" ASC LIMIT 1

  def api_checkout_account
    account = params[:account]
    agent = params[:agent]
    sub_agent = params[:sub_agent]
    transaction_amount = params[:transaction_amount]
    fee = params[:fee]
    remote_ip_address = request.remote_ip
    status = "|5000|"
    response_log = "none"
    error_log = "none"
    transaction_status = false
    otp = ""

    account_token = check_account_number(account)
    fee = cashout_fee(transaction_amount)

    if fee.blank?
      status = '|4043|'
    else
      if account_token.blank?
        status = '|4041|'
      else
        merchant_pos = CertifiedAgent.where("certified_agent_id = '#{params[:agent]}' AND sub_certified_agent_id IS NULL").first rescue nil
        if merchant_pos.blank?
          status = "|4042|"
        else
          if is_a_number?(transaction_amount) && is_a_number?(fee)
            transaction_id = Digest::SHA1.hexdigest([DateTime.now.iso8601(6), rand].join)
            BombLog.create(sent_url: "#{Parameter.first.paymoney_wallet_url}/PAYMONEY_WALLET/rest/cash_out_operation_pos/12345628/#{merchant_pos.token}/#{account_token}/#{transaction_amount}/#{fee}/0/#{transaction_id}/null")
---
SELECT  "certified_agents".* FROM "certified_agents"  WHERE (certified_agent_id = '1ffee1b27a94d34d' AND sub_certified_agent_id IS NULL)  ORDER BY "certified_agents"."id" ASC LIMIT 1
INSERT INTO "bomb_logs" ("created_at", "sent_url", "updated_at") VALUES ($1, $2, $3) RETURNING "id"
INSERT INTO "logs" ("account_number", "agent", "checkout_amount", "created_at", "fee", "otp", "pin", "remote_ip_address", "response_log", "status", "sub_agent", "thumb", "transaction_id", "transaction_type", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
SELECT  "parameters".* FROM "parameters"   ORDER BY "parameters"."id" ASC LIMIT 1

  def api_validate_credit
    pin = params[:pin]
    transaction_id = params[:transaction_id]
    agent = params[:agent]
    sub_agent = params[:sub_agent]
    remote_ip_address = request.remote_ip
    status = "|5000|"
    transaction = Log.find_by_otp(transaction_id)
    agent_token = CertifiedAgent.find_by_certified_agent_id(agent).token
    response_log = ""
    error_log = ""
    transaction_status = false

    if agent_token.blank?
      status = "|4042|"
    else
      if !pin.blank? && !transaction.blank?
        account_token = check_account_number(transaction.account_number)
        BombLog.create(sent_url: "#{Parameter.first.paymoney_wallet_url}/PAYMONEY_WALLET/rest/otp_active_pos/TYHHKIRE/#{account_token}/#{agent_token}/#{transaction.credit_amount}/0/#{transaction.thumb}/#{transaction.transaction_id}/null/#{pin}/#{transaction.otp}")
---
SELECT  "logs".* FROM "logs"  WHERE "logs"."otp" = '8414' LIMIT 1
SELECT  "certified_agents".* FROM "certified_agents"  WHERE "certified_agents"."certified_agent_id" = '684239a94ca63639' LIMIT 1
INSERT INTO "bomb_logs" ("created_at", "sent_url", "updated_at") VALUES ($1, $2, $3) RETURNING "id"
INSERT INTO "logs" ("agent", "created_at", "otp", "pin", "remote_ip_address", "response_log", "status", "sub_agent", "transaction_type", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
SELECT  "parameters".* FROM "parameters"   ORDER BY "parameters"."id" ASC LIMIT 1

  def api_validate_checkout
    pin = params[:pin]
    transaction_id = params[:transaction_id]
    agent = params[:agent]
    sub_agent = params[:sub_agent]
    remote_ip_address = request.remote_ip
    status = "|5000|"
    transaction = Log.find_by_otp(transaction_id)
    agent_token = CertifiedAgent.find_by_certified_agent_id(agent).token
    response_log = ""
    error_log = ""
    transaction_status = false

    if agent_token.blank?
      status = "|4042|"
    else
      if !pin.blank? && !transaction.blank?
        account_token = check_account_number(transaction.account_number)
        BombLog.create(sent_url: "#{Parameter.first.paymoney_wallet_url}/PAYMONEY_WALLET/rest/otp_active_pos/12345628/#{agent_token}/#{account_token}/#{transaction.checkout_amount}/#{transaction.fee}/#{transaction.thumb}/#{transaction.transaction_id}/null/#{pin}/#{transaction.otp}")
---
SELECT  "logs".* FROM "logs"  WHERE "logs"."otp" = '745112681441043095641' LIMIT 1
SELECT  "certified_agents".* FROM "certified_agents"  WHERE "certified_agents"."certified_agent_id" = '2c41a884201d672e' LIMIT 1
INSERT INTO "bomb_logs" ("created_at", "sent_url", "updated_at") VALUES ($1, $2, $3) RETURNING "id"
INSERT INTO "logs" ("agent", "created_at", "otp", "pin", "remote_ip_address", "response_log", "status", "sub_agent", "transaction_type", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
SELECT  "parameters".* FROM "parameters"   ORDER BY "parameters"."id" ASC LIMIT 1

  def api_ascent
    transaction_amount = params[:transaction_amount]
    agent = params[:agent]
    sub_agent = params[:sub_agent]
    remote_ip_address = request.remote_ip
    response_log = "none"
    error_log = "none"
    status = "|5000|"
    transaction_status = false

    merchant_pos = CertifiedAgent.where("certified_agent_id = '#{params[:agent]}' AND sub_certified_agent_id IS NULL").first rescue nil
    if merchant_pos.blank?
      status = "|4042|"
    else
      private_pos = CertifiedAgent.where("sub_certified_agent_id = '#{params[:sub_agent]}' ").first rescue nil
      if private_pos.blank?
        status = "|4041|"
      else
        if is_a_number?(transaction_amount)
          transaction_id = Digest::SHA1.hexdigest([DateTime.now.iso8601(6), rand].join)
          BombLog.create(sent_url: "#{Parameter.first.paymoney_wallet_url}/PAYMONEY_WALLET/rest/Remonte/78945612/#{merchant_pos.token}/#{private_pos.token}/#{transaction_amount}/0/0/#{transaction_id}/null")
---
SELECT  "certified_agents".* FROM "certified_agents"  WHERE (certified_agent_id = 'e24624454e6f0cd5' AND sub_certified_agent_id IS NULL)  ORDER BY "certified_agents"."id" ASC LIMIT 1
INSERT INTO "logs" ("agent", "created_at", "credit_amount", "remote_ip_address", "response_log", "status", "sub_agent", "transaction_id", "transaction_type", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
SELECT  "parameters".* FROM "parameters"   ORDER BY "parameters"."id" ASC LIMIT 1

  def api_transfer
    transaction_amount = params[:transaction_amount]
    transaction_transfer_fee = transfer_fee(transaction_amount)
    a_account_transfer = params[:a_account_token]
    b_account_transfer = params[:b_account_token]
    remote_ip_address = request.remote_ip
    response_log = "none"
    error_log = "none"
    status = "|5000|"
    transaction_status = false

    if is_a_number?(transaction_amount)
      transaction_id = Digest::SHA1.hexdigest([DateTime.now.iso8601(6), rand].join)
      BombLog.create(sent_url: "#{Parameter.first.paymoney_wallet_url}/PAYMONEY_WALLET/rest/cashtransact/85245623/#{a_account_transfer}/#{b_account_transfer}/#{transaction_amount}/#{transaction_transfer_fee}/100/#{transaction_id}")
---
INSERT INTO "logs" ("a_account_transfer", "b_account_transfer", "created_at", "credit_amount", "fee", "remote_ip_address", "response_log", "status", "transaction_id", "transaction_type", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
SELECT  "parameters".* FROM "parameters"   ORDER BY "parameters"."id" ASC LIMIT 1

  def api_get_bet
    transaction_amount = params[:transaction_amount]
    game_account_token = params[:game_account_token]
    password = params[:password]
    account_token = params[:account_token]
    remote_ip_address = request.remote_ip
    response_log = "none"
    error_log = "none"
    status = "|5000|"
    transaction_status = false

    if is_a_number?(transaction_amount)
      transaction_id = params[:transaction_id]#Digest::SHA1.hexdigest([DateTime.now.iso8601(6), rand].join)
      BombLog.create(sent_url: "#{Parameter.first.paymoney_wallet_url}/PAYMONEY_WALLET/rest/prise_paris/96325874/#{game_account_token}/#{account_token}/#{transaction_amount}/0/0/#{transaction_id}/#{password}")
---
INSERT INTO "bomb_logs" ("created_at", "sent_url", "updated_at") VALUES ($1, $2, $3) RETURNING "id"
INSERT INTO "logs" ("account_token", "bet_placed", "bet_placed_at", "checkout_amount", "created_at", "game_account_token", "remote_ip_address", "response_log", "status", "transaction_id", "transaction_type", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
SELECT  "parameters".* FROM "parameters"   ORDER BY "parameters"."id" ASC LIMIT 1

  def api_get_bet_without_cancellation
    transaction_amount = params[:transaction_amount]
    game_account_token = params[:game_account_token]
    password = params[:password]
    account_token = params[:account_token]
    remote_ip_address = request.remote_ip
    response_log = "none"
    error_log = "none"
    status = "|5000|"
    transaction_status = false

    if is_a_number?(transaction_amount)
      transaction_id = params[:transaction_id]#Digest::SHA1.hexdigest([DateTime.now.iso8601(6), rand].join)
      BombLog.create(sent_url: "#{Parameter.first.paymoney_wallet_url}/PAYMONEY_WALLET/rest/prise_paris_first/96325874/#{game_account_token}/#{account_token}/#{transaction_amount}/0/0/#{transaction_id}/#{password}")
---
INSERT INTO "bomb_logs" ("created_at", "sent_url", "updated_at") VALUES ($1, $2, $3) RETURNING "id"
INSERT INTO "logs" ("account_token", "bet_placed", "bet_placed_at", "checkout_amount", "created_at", "game_account_token", "remote_ip_address", "response_log", "status", "transaction_id", "transaction_type", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
SELECT  "parameters".* FROM "parameters"   ORDER BY "parameters"."id" ASC LIMIT 1

  def api_validate_bet
    transaction_amount = params[:transaction_amount].to_f
    game_account_token = params[:game_account_token]
    remote_ip_address = request.remote_ip
    bets = Log.where("game_account_token = '#{game_account_token}' AND bet_validated IS NULL")
    response_log = "none"
    error_log = "none"
    status = "|5000|"
    transaction_status = false

    unless bets.blank?
      transaction_id = Digest::SHA1.hexdigest([DateTime.now.iso8601(6), rand].join).hex.to_s[0..17]
      status = "|5001|"

      BombLog.create(sent_url: "#{Parameter.first.paymoney_wallet_url}/PAYMONEY_WALLET/rest/valide_paris/96325874/#{game_account_token}/#{transaction_amount}/0/0/#{transaction_id}")
---
SELECT "logs".* FROM "logs"  WHERE (game_account_token = 'uXAXMDuW' AND bet_validated IS NULL)
INSERT INTO "bomb_logs" ("created_at", "sent_url", "updated_at") VALUES ($1, $2, $3) RETURNING "id"
INSERT INTO "logs" ("bet_validated", "bet_validated_at", "checkout_amount", "created_at", "game_account_token", "remote_ip_address", "response_log", "transaction_id", "transaction_type", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
SELECT  "logs".* FROM "logs"  WHERE "logs"."transaction_id" = '1000256db7765bb86ed7913a6b81fd629184d1fc' LIMIT 1
SELECT  "parameters".* FROM "parameters"   ORDER BY "parameters"."id" ASC LIMIT 1

  def api_payback_bet
    bet = (Log.where(bet_placed: true, bet_validated: nil, transaction_id: params[:transaction_id]).first )

    remote_ip_address = request.remote_ip
    response_log = "none"
    error_log = "none"
    status = "|5000|"
    transaction_status = false

    if !bet.blank?
      transaction_amount = bet.checkout_amount
      account_token = bet.account_token
      game_account_token = bet.game_account_token
      transaction_id = bet.transaction_id

      BombLog.create(sent_url: "#{Parameter.first.paymoney_wallet_url}/PAYMONEY_WALLET/rest/remboursement_paris/96325874/#{game_account_token}/#{account_token}/#{transaction_amount}/0/0/#{transaction_id}")
      response = (RestClient.get "#{Parameter.first.paymoney_wallet_url}/PAYMONEY_WALLET/rest/remboursement_paris/96325874/#{game_account_token}/#{account_token}/#{transaction_amount}/0/0/#{transaction_id}" rescue "")

      unless response.blank?
        if response.to_s == "good"
          status = transaction_id
          response_log = response.to_s
          transaction_status = true
          bet.update_attributes(transaction_type: "Remboursement de paris", response_log: response_log, bet_paid_back: true, bet_paid_back_at: DateTime.now, remote_ip_address: remote_ip_address)
---
SELECT  "logs".* FROM "logs"  WHERE "logs"."bet_placed" = 't' AND "logs"."bet_validated" IS NULL AND "logs"."transaction_id" = '223cea90ccb46a714d54cf8271dd4498f71915bc'  ORDER BY "logs"."id" ASC LIMIT 1
INSERT INTO "bomb_logs" ("created_at", "sent_url", "updated_at") VALUES ($1, $2, $3) RETURNING "id"
SELECT  "parameters".* FROM "parameters"   ORDER BY "parameters"."id" ASC LIMIT 1
UPDATE "logs" SET "bet_paid_back" = $1, "bet_paid_back_at" = $2, "error_log" = $3, "transaction_type" = $4, "updated_at" = $5 WHERE "logs"."id" = 136  [["bet_paid_back", "f"], ["bet_paid_back_at", "2015-11-27 14:28:49.786785"], ["error_log", ""], ["transaction_type", "Remboursement de paris"], ["updated_at", "2015-11-27 14:28:49.789084"]]

  def api_pay_earnings
    transaction_amount = params[:transaction_amount]
    game_account_token = params[:game_account_token]
    account_token = params[:account_token]
    transaction_id = params[:transaction_id]
    remote_ip_address = request.remote_ip
    response_log = "none"
    error_log = "none"
    status = "|5000|"
    transaction_status = false

    if is_a_number?(transaction_amount)
      #transaction_id = Digest::SHA1.hexdigest([DateTime.now.iso8601(6), rand].join)
      BombLog.create(sent_url: "#{Parameter.first.paymoney_wallet_url}/PAYMONEY_WALLET/rest/paiement_gain/74125895/#{account_token}/#{game_account_token}/#{transaction_amount}/0/0/#{transaction_id}")
---
INSERT INTO "logs" ("account_token", "created_at", "credit_amount", "game_account_token", "remote_ip_address", "response_log", "status", "transaction_id", "transaction_type", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
SELECT  "parameters".* FROM "parameters"   ORDER BY "parameters"."id" ASC LIMIT 1

  def api_deposit
    transaction_amount = params[:transaction_amount]
    account_number = params[:account_number]
    remote_ip_address = request.remote_ip
    response_log = "none"
    error_log = "none"
    status = "|5000|"
    transaction_status = false

    account_token = check_account_number(account_number)

    if account_token.blank?
      status = "|4041|"
    else
      if is_a_number?(transaction_amount)
        transaction_id = Digest::SHA1.hexdigest([DateTime.now.iso8601(6), rand].join)
        BombLog.create(sent_url: "#{Parameter.first.paymoney_wallet_url}/PAYMONEY_WALLET/rest/cash_in_pos/53740905/#{account_token}/#{transaction_amount}/#{transaction_id}")
---
INSERT INTO "bomb_logs" ("created_at", "sent_url", "updated_at") VALUES ($1, $2, $3) RETURNING "id"
INSERT INTO "logs" ("account_token", "created_at", "credit_amount", "remote_ip_address", "response_log", "status", "transaction_id", "transaction_type", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT  "parameters".* FROM "parameters"   ORDER BY "parameters"."id" ASC LIMIT 1

  def cashin_mobile_money
    transaction_amount = params[:transaction_amount]
    account = params[:account]
    fee = params[:fee]
    mobile_money_account = params[:mobile_money_account]
    remote_ip_address = request.remote_ip
    response_log = "none"
    error_log = "none"
    status = "|5000|"
    transaction_status = false

    account_token = check_account_number(account)
    mobile_money_token = check_account_number(mobile_money_account)

    if !account_token.blank? && !mobile_money_token.blank?
      if is_a_number?(transaction_amount)
        transaction_id = Digest::SHA1.hexdigest([DateTime.now.iso8601(6), rand].join)
        BombLog.create(sent_url: "#{Parameter.first.paymoney_wallet_url}/PAYMONEY_WALLET/rest/cash_in_operation_momo/tertybgd/#{account_token}/#{mobile_money_token}/#{transaction_amount}/#{fee}/100/#{transaction_id}")
---
INSERT INTO "logs" ("account_number", "created_at", "credit_amount", "error_log", "mobile_money_account_number", "remote_ip_address", "status", "transaction_id", "transaction_type", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
SELECT  "parameters".* FROM "parameters"   ORDER BY "parameters"."id" ASC LIMIT 1

  def cashout_mobile_money
    transaction_amount = params[:transaction_amount]
    account = params[:account]
    fee = params[:fee]
    mobile_money_account = params[:mobile_money_account]
    remote_ip_address = request.remote_ip
    response_log = "none"
    error_log = "none"
    status = "|5000|"
    transaction_status = false

    account_token = check_account_number(account)
    mobile_money_token = check_account_number(mobile_money_account)

    if !account_token.blank? && !mobile_money_token.blank?
      if is_a_number?(transaction_amount)
        transaction_id = Digest::SHA1.hexdigest([DateTime.now.iso8601(6), rand].join)
        BombLog.create(sent_url: "#{Parameter.first.paymoney_wallet_url}/PAYMONEY_WALLET/rest/cash_out_operation_momo/14725836/#{account_token}/#{mobile_money_token}/#{transaction_amount}/#{fee}/100/#{transaction_id}")
---
INSERT INTO "logs" ("account_number", "checkout_amount", "created_at", "error_log", "mobile_money_account_number", "remote_ip_address", "status", "transaction_id", "transaction_type", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
SELECT  "parameters".* FROM "parameters"   ORDER BY "parameters"."id" ASC LIMIT 1