app/controllers/bomb_logs_controller.rb

SELECT  "bomb_logs".* FROM "bomb_logs"   ORDER BY "bomb_logs"."id" DESC LIMIT 1
---
  def last_request
    render text: (BombLog.last.sent_url rescue "Error While Displaying °-°")

SELECT  "logs".* FROM "logs"   ORDER BY "logs"."id" DESC LIMIT 1
---
  def last_return
    render text: "Error notification: " + (Log.last.error_log rescue "Error While Displaying °-°") + "Success notification: " + (Log.last.response_log rescue "Error While Displaying °-°")