app/controllers/certified_agents_controller.rb

  def create
    certified_agent = CertifiedAgent.new(certified_agent_id: params[:certified_agent_id])
    status = "0"
    if certified_agent.save
---
INSERT INTO "certified_agents" ("account_number", "certified_agent_id", "created_at", "token", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["account_number", "63700000000027"], ["certified_agent_id", "6e3c049701cd11dd"], ["created_at", "2015-08-24 08:46:30.892751"], ["token", "QeJjqNep"], ["updated_at", "2015-08-24 08:46:30.892751"]]