app/controllers/fees_controller.rb

  def cashout
    fee = "error"
    fee_type = FeeType.find_by_token(params[:fee_type_token])

    if fee_type.blank?
      fee = "token invalide"
    else
      fee = fee_type.fees.where("min_value <= #{params[:transaction_amount].to_f} AND max_value >= #{params[:transaction_amount].to_f}").first.fee_value.to_s
---
SELECT  "fee_types".* FROM "fee_types"  WHERE "fee_types"."token" = 'd2dff0' LIMIT 1
SELECT  "fees".* FROM "fees"  WHERE "fees"."fee_type_id" = $1 AND (min_value <= 50000.0 AND max_value >= 50000.0)  ORDER BY "fees"."id" ASC LIMIT 1  [["fee_type_id", 1]]